src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееВремя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестоРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РегламентныеПроцедуры/Ext/Module.bsl
Процедура ОбновлениеИндекса() Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Запуск регламентного задания Обновление индекса  " + ТекущаяДата();
	Сообщение.Сообщить();

	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() =  РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс( , Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура СлияниеИндексов() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() =  РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьПисьмоДляЗаполненияТЛиста() Экспорт
	
	Тема = "Внимание 5 минут до конца рабочего дня заполните т-лист: " + Формат(ТекущаяДата(), "ДЛФ=DT");
	ВидПочтовогоСообщения =  Тема + " Заполните т-лист!";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка,
	                      |	Пользователи.ПочтовыйАдрес
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.УчаствуетВРассылке = ИСТИНА");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭкспортируемыеПодпрограммы.ПослатьСообщение(Выборка.ПочтовыйАдрес, ВидПочтовогоСообщения, Тема, Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
